[
  {
    "course_code": "NE 100",
    "course_name": "Introduction to Nanotechnology Engineering",
    "course_desc": "An introduction to nanotechnology engineering and its various applications from electronics to biology. Basic concepts related to nanomaterials and devices, fabrication approaches, and characterization methods. Introduction to engineering iterative design, computer aided design (CAD) and modelling. Application of CAD methods in relevant nanotechnology engineering problems. Engineering report preparation skills. [Offered: F]",
    "term": "1A",
    "x": 0,
    "y": 0
  },
  {
    "course_code": "NE 101",
    "course_name": "Nanotechnology Engineering Practice",
    "course_desc": "Areas of research and professional practice in nanotechnology engineering; exposure to concepts from other engineering plans; support material for the 1A academic term. [Offered: F]",
    "term": "1A",
    "x": 0,
    "y": 100
  },
  {
    "course_code": "NE 102",
    "course_name": "Introduction to Nanomaterials Health Risk; Nanotechnology Engineering Practice",
    "course_desc": "Introduction to types of nanomaterials hazards their identification, toxicity, and characterization; exposure health-risk assessment; cancer and non-cancer risks. Areas of research and professional practice in nanotechnology engineering; exposure to concepts from other engineering plans; support material for the 1B academic term, including aspects of co-operative education and professional or career development. [Note: This course is graded as CR/NCR and is considered as DRNC. Offered: W]",
    "term": "1B",
    "x": 200,
    "y": 0
  },
  {
    "course_code": "NE 102B",
    "course_name": "Nanotechnology Engineering Practice",
    "course_desc": "Areas of research and professional practice in nanotechnology engineering; exposure to concepts from other engineering plans; support material for the 1B academic term, including aspects of co-operative education and professional or career development. [Offered: W]",
    "term": "1B",
    "x": 200,
    "y": 100
  },
  {
    "course_code": "NE 109",
    "course_name": "Societal and Environmental Impacts of Nanotechnology",
    "course_desc": "Nanotechnology in society; health and environmental sustainability; engineering ethics, policies, and regulations; Canadian legal system, tort, and intellectual property; examples of nanotechnology innovation and commercialization. [Offered: F]",
    "term": "1A",
    "x": 0,
    "y": 200
  },
  {
    "course_code": "NE 110",
    "course_name": "Introduction to Nanomaterials Health Risks",
    "course_desc": "Nanomaterial impacts on worker, consumer, and environmental health. Engineered nanomaterials and ultrafines. Chemical risk assessment. Nanomaterial exposure characterization. Introductory nanotoxicology. Environmental chemical impacts, transport, and bio-accumulation. Human risks, and benefits. Introductory epidemiology, including study design, strength of association, bias, confounding and causal inference. [Offered: W]",
    "term": "1B",
    "x": 200,
    "y": 200
  },
  {
    "course_code": "NE 111",
    "course_name": "Introduction to Programming for Engineers",
    "course_desc": "Introduction to programming and numerical computing using a high-level interpreted programming language. Programming fundamentals, computer architecture, design and use of functions, strings and text input/output, relational operators, conditionals, lists, loops, designing algorithms, numerical computing, plotting, and file input/output. [Note: This course includes online components. Offered: F]",
    "term": "1A",
    "x": 0,
    "y": 300
  },
  {
    "course_code": "NE 112",
    "course_name": "Linear Algebra for Nanotechnology Engineers",
    "course_desc": "Matrices, operations on matrices. Determinants. Adjoints and inverses. Solution of linear equations: elimination and iterative methods. Eigenvalues and eigenvectors with engineering applications. Complex numbers. [Offered: F] ",
    "term": "1A",
    "x": 0,
    "y": 400
  },
  {
    "course_code": "NE 113",
    "course_name": "Introduction to Computational Methods",
    "course_desc": "Spreadsheets for problem solving, plotting, fitting data. Problem solution plotting, and creating complex programs in an engineering prototypical programming environment. Elementary numerical methods: Taylor-series summations, roots of equations, roots of polynomials, direct and indirect solution methods for systems of linear, and nonlinear algebraic equations, integration. Applications in nanotechnology engineering. [Offered: W] ",
    "term": "1B",
    "x": 200,
    "y": 300
  },
  {
    "course_code": "NE 121",
    "course_name": "Chemical Principles",
    "course_desc": "Chemical reactions. Mass and charge balance. Introduction to the first, second, and third laws of thermodynamics. Chemical equilibrium. Applications of chemical equilibrium principles to proton-transfer reactions. Electronic structure of atoms and molecules. Periodicity and chemical bonding. [Offered: F] ",
    "term": "1A",
    "x": 0,
    "y": 500
  },
  {
    "course_code": "NE 125",
    "course_name": "Introduction to Materials Science and Engineering",
    "course_desc": "Fundamentals of crystalline structure, crystal defects, and noncrystallinity. Structure and properties of metals, ceramics, glasses, amorphous materials, polymers, and composites. Processing and concepts of engineering design of materials. [Offered: W] ",
    "term": "1B",
    "x": 200,
    "y": 400
  },
  {
    "course_code": "NE 131",
    "course_name": "Physics for Nanotechnology Engineering",
    "course_desc": "A first course in physics that introduces basic topics in classical mechanics, wave mechanics, and physical optics. [Offered: W] ",
    "term": "1B",
    "x": 200,
    "y": 500
  },
  {
    "course_code": "NE 140",
    "course_name": "Linear Circuits",
    "course_desc": "Charge, current, and voltage. Resistance, Ohm's Law, Kirchhoff's voltage, and current laws. Nodal, mesh analysis, and source transformation. Superposition, Thévenin, and Norton equivalents. Capacitance, inductance, electrical energy dissipation, and first-order transient response circuits. Phasors, impedances, and alternating current (AC) steady state analysis. Diodes circuit applications. Ideal operational amplifier circuits. Frequency filter types, and active filter circuits' configuration. [Offered: W] ",
    "term": "1B",
    "x": 200,
    "y": 600
  },
  {
    "course_code": "NE 201",
    "course_name": "Nanotoxicology; Nanotechnology Engineering Practice",
    "course_desc": "Nanotoxicology, including inhalation and dermal exposure effects; translocation, cytotoxicity, mutagenicity, and neurotoxicity; carbon nanotubes as cancer hazards. Areas of research and professional practice in nanotechnology engineering; exposure to concepts from other engineering plans; support material for the 2A academic term, including aspects of co-operative education and professional or career development. [Note: This course is graded as CR/NCR and is considered as DRNC. Offered: F]",
    "term": "2A",
    "x": 400,
    "y": 0
  },
  {
    "course_code": "NE 201A",
    "course_name": "Nanotechnology Engineering Practice",
    "course_desc": "Areas of research and professional practice in nanotechnology engineering; exposure to concepts from other engineering plans; support material for the 2A academic term, including aspects of co-operative education and professional or career development. [Offered: F, first offered Fall 2023]",
    "term": "2A",
    "x": 400,
    "y": 100
  },
  {
    "course_code": "NE 202",
    "course_name": "Nanomaterials and Environmental Impact; Nanotechnology Engineering Practice",
    "course_desc": "Environmental fate and behaviour, bio-availability, consumer exposure, environmental exposure-assessment, aquatic toxicology, bio-accumulation and biomagnification. Areas of research and professional practice in nanotechnology engineering; exposure to concepts from other engineering plans; support material for the 2B academic term, including aspects of co-operative education and professional or career development. [Note: This course is graded as CR/NCR and is considered as DRNC. Offered: S]",
    "term": "2B",
    "x": 600,
    "y": 0
  },
  {
    "course_code": "NE 202B",
    "course_name": "Nanotechnology Engineering Practice",
    "course_desc": "Areas of research and professional practice in nanotechnology engineering; exposure to concepts from other engineering plans; support material for the 2B academic term, including aspects of co-operative education and professional or career development. [Offered: S, first offered spring 2024]",
    "term": "2B",
    "x": 600,
    "y": 100
  },
  {
    "course_code": "NE 215",
    "course_name": "Probability and Statistics",
    "course_desc": "Elementary probability theory. Random variables and distributions. Binomial, Poisson, and normal distributions. Elementary sampling. Statistical estimation. Tests of hypotheses and significance. Regression. Goodness-of-fit tests. [Offered: F] ",
    "term": "2A",
    "x": 400,
    "y": 200
  },
  {
    "course_code": "NE 216",
    "course_name": "Advanced Calculus and Numerical Methods 1",
    "course_desc": "Ordinary differential equations with constant coefficients. Boundary value problems and applications to quantum mechanics. Laplace and Fourier transforms, Fourier series and applications. Numerical solution of ordinary differential equations. [Offered: F] ",
    "term": "2A",
    "x": 400,
    "y": 300
  },
  {
    "course_code": "NE 217",
    "course_name": "Advanced Calculus and Numerical Methods 2",
    "course_desc": "Gradient, Divergence and Curl: Applications. Line and Surface Integrals. Green's, Gauss', and Stokes' Theorems: Applications to electromagnetism and fluid mechanics. Numerical solution of partial differential equations. [Offered: S]",
    "term": "2B",
    "x": 600,
    "y": 200
  },
  {
    "course_code": "NE 220L",
    "course_name": "Materials Science and Engineering Laboratory",
    "course_desc": "Labs following the NE 125 Introduction to Materials Science and Engineering course. This laboratory course introduces students to techniques for the characterization of various materials, such as metals, polymers, ceramics, and composites. Experimental exercises will study the physical properties and characteristics of materials, including mechanical, thermal, electrical, and structural/morphological properties at different length scales. [Offered: F]",
    "term": "2A",
    "x": 400,
    "y": 400
  },
  {
    "course_code": "NE 222",
    "course_name": "Organic Chemistry for Nanotechnology Engineers",
    "course_desc": "Nomenclature, stereochemistry and reactions of important classes of organic compounds. Reaction mechanisms and energetics. Aromaticity and simple molecular orbital theory of conjugated systems. Applications to nanomaterials and/or devices. [Offered: F] ",
    "term": "2A",
    "x": 400,
    "y": 500
  },
  {
    "course_code": "NE 224",
    "course_name": "Biochemistry for Nanotechnology Engineers",
    "course_desc": "An introduction to the chemistry of amino acids, carbohydrates, lipids and nucleic acids. Structure and properties of proteins and enzymes. An introduction to cell biochemistry. Applications to nanobiotechnology. [Offered: S] ",
    "term": "2B",
    "x": 600,
    "y": 300
  },
  {
    "course_code": "NE 225",
    "course_name": "Structure and Properties of Nanomaterials",
    "course_desc": "Electronic orbitals in atoms, molecules and the solid state. Structures and properties of covalent and ionic solid nanoparticles including their catalytic, electrochemical, electrical, optical and magnetic properties. Semiconductors and carbon/silicon-based nanoparticles. Examples discussed include carbon nanoparticles, dendrimers, micelles, and quantum dots. [Offered: S]",
    "term": "2B",
    "x": 600,
    "y": 400
  },
  {
    "course_code": "NE 226",
    "course_name": "Characterization of Materials",
    "course_desc": "Materials structure analysis. Materials composition and chemical bonding analysis. In-situ analysis and monitoring of fabrication process parameters. Materials properties characterization. [Offered: S]",
    "term": "2B",
    "x": 600,
    "y": 500
  },
  {
    "course_code": "NE 226L",
    "course_name": "Laboratory Characterization Methods",
    "course_desc": "This laboratory course introduces students to six materials characterization techniques employed routinely by nanotechnology engineers in their practices. Specifically, the six techniques are: Fourier-Transform Infrared (FTIR), Raman light-scattering, and ultra-violet and visible (UV-Vis) spectroscopies, ellipsometry, X-ray diffraction (XRD), and scanning electron microscopy (SEM). This course is intended to familiarize students with the instrumentation involved, prior to its application to nanomaterials in a follow-up laboratory course, NE 320L. [Offered: S]",
    "term": "2A",
    "x": 400,
    "y": 600
  },
  {
    "course_code": "NE 241",
    "course_name": "Electromagnetism",
    "course_desc": "Coulomb's law, electric field and electric flux, Gauss's law, electric potential, potential and field, magnetic field, Ampere's law, solenoid, electromagnetic induction, magnetic flux, Lenz' law, Faraday's law, capacitors and capacitance, inductors and inductance, Maxwell's equations, electromagnetic fields and waves, polarization. [Offered: F] ",
    "term": "2A",
    "x": 400,
    "y": 700
  },
  {
    "course_code": "NE 242",
    "course_name": "Semiconductor Physics and Devices",
    "course_desc": "Introduction to the physical principles and electrical behaviour of semiconductor materials and devices: electronic band structure, charge carriers, doping, carrier transport, pn-junctions, metal-oxide-semiconductor capacitors, transistors, and related optoelectronic devices (photodetectors, light emitting diodes, solar cells). [Offered: S] ",
    "term": "2B",
    "x": 600,
    "y": 600
  },
  {
    "course_code": "NE 281",
    "course_name": "Biology for Nanotechnology Engineers",
    "course_desc": "Introduction to cell biology. Cell structure and components. Critical molecular processes of living organisms. Applications to nanobiotechnology. [Offered: S, first offered spring 2024] ",
    "term": "2B",
    "x": 600,
    "y": 700
  },
  {
    "course_code": "NE 301",
    "course_name": "Nanomaterials and Human Risks, Benefits; Nanotechnology Engineering Practice",
    "course_desc": "Detoxification and bioactivation pathways; surface modification; biopersistence; quantum dots and cellular imagining; biomedical applications of nanomaterials. Areas of research and professional practice in nanotechnology engineering; exposure to concepts from other engineering plans; support material for the 3A academic term, including aspects of co-operative education and professional or career development. [Note: This course is graded as CR/NCR and is considered as DRNC. Offered: S]",
    "term": "3A",
    "x": 800,
    "y": 0
  },
  {
    "course_code": "NE 301A",
    "course_name": "Nanotechnology Engineering Practice",
    "course_desc": "Areas of research and professional practice in nanotechnology engineering; exposure to concepts from other engineering plans; support material for the 3A academic term, including aspects of co-operative education and professional or career development. [Offered: S, first offered spring 2025]",
    "term": "3A",
    "x": 800,
    "y": 100
  },
  {
    "course_code": "NE 302",
    "course_name": "Nanotechnology Engineering Practice",
    "course_desc": "Areas of research and professional practice in nanotechnology engineering; exposure to concepts from other engineering plans; support material for the 3B academic term, including aspects of co-operative education and professional or career development. [Offered: F]",
    "term": "3B",
    "x": 1000,
    "y": 0
  },
  {
    "course_code": "NE 307",
    "course_name": "Introduction to Nanosystems Design",
    "course_desc": "Introduction to the engineering design process: problem definition and needs analysis; process synthesis, analysis, optimization and troubleshooting; safety and environmental protection in design; written and oral communication for design reports. Students form four-person design teams and start a team-oriented project based on the knowledge and skills acquired in previous courses and on co-operative work terms, culminating in a design proposal presentation. [Offered: F]",
    "term": "3B",
    "x": 1000,
    "y": 100
  },
  {
    "course_code": "NE 318",
    "course_name": "Continuum Mechanics for Nanotechnology Engineering",
    "course_desc": "Tensor operations. Kinematics of a continuum: material and spatial frames, strain and displacement, conservation of mass. Stress, conservation of momentum, energy, and mass. Linear elastic solids: Hooke's Law, infinitesimal elasticity theory. Introduction to Newtonian viscous fluids: hydrostatics, Navier-Stokes equations, flow regimes, and the Reynolds number. Engineering applications in anisotropy, heat transfer, and fluid mechanics will be discussed. [Offered: S]",
    "term": "3A",
    "x": 800,
    "y": 200
  },
  {
    "course_code": "NE 320L",
    "course_name": "Characterization of Materials Laboratory",
    "course_desc": "Follow-up labs associated with the NE 226 (Characterization of Materials) course. The laboratory exercises focus upon the synthesis and characterization of nano-based materials. Specifically, the synthesis of carbon nanotubes, quantum dots, magnetic ceramics, or other common nanomaterials will be investigated, and sample preparations for various characterization tools will be carried out. Characterization techniques such as infrared and Raman spectroscopy, x-ray diffraction, scanning electron microscope (SEM), and magnetic inductive heating will be utilized. [Offered: S]",
    "term": "3A",
    "x": 800,
    "y": 300
  },
  {
    "course_code": "NE 330L",
    "course_name": "Macromolecular Science Laboratory",
    "course_desc": "Lab exercises exploring the synthesis and characterization of polymers, copolymers, and soft nanomaterial structures. [Offered: F]",
    "term": "3B",
    "x": 1000,
    "y": 200
  },
  {
    "course_code": "NE 332",
    "course_name": "Quantum Mechanics",
    "course_desc": "Historical background; the differential equation approach to quantum mechanics; treatments of solvable problems such as the particle-in-a-box, harmonic oscillator, rigid rotor, and the hydrogen atom; introduction to approximation methods for more complex systems; application to solid state problems, including band theory. [Offered: S] ",
    "term": "3A",
    "x": 800,
    "y": 400
  },
  {
    "course_code": "NE 333",
    "course_name": "Macromolecular Science",
    "course_desc": "Basic definitions and polymer nomenclature, molecular weight averages and distributions, constitutional and configurational isomerism, rubber elasticity, step-growth and free-radical chain-growth polymerizations, emulsion polymerization. [Offered: S] ",
    "term": "3A",
    "x": 800,
    "y": 500
  },
  {
    "course_code": "NE 334",
    "course_name": "Statistical Thermodynamics",
    "course_desc": "Statistical mechanics vs. thermodynamics. Review of statistical concepts. Canonical and grand canonical ensembles. Entropy. General formulation of statistical thermodynamics. Fermi-Dirac, Bose-Einstein, and Boltzmann statistics. Quantum ideal gases. Specific heat of solids. Electrons in metals and semiconductors. Radiation: the photon gas. [Offered: F, first fall offering, Fall 2022] ",
    "term": "3B",
    "x": 1000,
    "y": 300
  },
  {
    "course_code": "NE 335",
    "course_name": "Soft Nanomaterials",
    "course_desc": "Introduction to the applications of macromolecules in nanotechnology. Block copolymers and self-assembled polymerization. Micelles and colloids. Dendrimers and molecular brushes. Supramolecular polymers, polymeric blends, and macromolecular nanocomposites. Polymer templates. Applications in the manufacturing of nanostructured materials and nanoscale devices. [Offered: F] ",
    "term": "3B",
    "x": 1000,
    "y": 400
  },
  {
    "course_code": "NE 336",
    "course_name": "Micro and Nanosystem Computer-aided Design",
    "course_desc": "Modeling and simulation. Lumped versus distributed approaches. Review of differential-equation systems, constitutive relations, boundary conditions, and solvers for complex, coupled transport problems pertinent to micro and nanosystems. Coupling strategies. Numerical schemes for nonlinear systems. Basic modeling and simulation of micro and nanosystems, and fluidic systems. Relevant nanotechnology applications: optical, thermal, mechanical, and fluidic microstructures, and nanoscale devices. [Offered: F]",
    "term": "3B",
    "x": 1000,
    "y": 500
  },
  {
    "course_code": "NE 340L",
    "course_name": "Microfabrication and Thin-film Technology Laboratory",
    "course_desc": "Labs associated with the NE 343 (Microfabrication and Thin-film Technology) course. Lab topics may include: thin film deposition by PECVD and PVD (sputtering); photolithography; dry and wet etching; and C-V and I-V analysis of MIS structures. [Offered: F]",
    "term": "3B",
    "x": 1000,
    "y": 600
  },
  {
    "course_code": "NE 343",
    "course_name": "Microfabrication and Thin-film Technology",
    "course_desc": "Key processes for electronic device fabrication. Single crystal growth. Substrate preparation. Homoepitaxy, heteroepitaxy, and molecular-beam epitaxy. Ion implantation. Oxidation and diffusion. Physical and chemical vapor deposition. Sputtering and evaporation. Etching. Micromachining. Spin coating and printing. Photolithography. Effects of device scaling on chip performance. Process integration. Yield and reliability. [Offered: S] ",
    "term": "3A",
    "x": 800,
    "y": 600
  },
  {
    "course_code": "NE 344",
    "course_name": "Electronic Circuits",
    "course_desc": "Metal-oxide-semiconductor field-effect transistor (MOSFET), circuit biasing and load-line analysis. Small-signal equivalent circuits and single stage amplifier configurations. Differential and multistage MOSFET amplifiers. The cascode configuration, current mirror and active loads. Feedback circuit configurations and stability. Oscillators, waveform shaping circuits and delay analysis. Introduction to digital circuits, the transistor switch, inverter circuits and complementary metal-oxide-semiconductor (CMOS) logic circuits. [Offered: F] ",
    "term": "3B",
    "x": 1000,
    "y": 700
  },
  {
    "course_code": "NE 345",
    "course_name": "Photonic Materials and Devices",
    "course_desc": "Wave nature of light, refractive index and dispersion, group velocity, irradiance and Poynting vector, Snell's law, Fresnel's Equation, antireflection coatings, absorption of light, temporal and spatial coherence, dielectric waveguides and optical fibers, planar waveguides, dispersion in waveguides; light emitting diodes (LED), pn junction, LED materials, stimulated emission, lasers, photodetectors, photovoltaic devices, solar cells. [Offered: F]",
    "term": "3B",
    "x": 1000,
    "y": 800
  },
  {
    "course_code": "NE 350",
    "course_name": "Work-term Report 2",
    "course_desc": "An engineering report based upon a technical project, activity, or analysis carried out by the student, normally during work-term employment following the 2B academic term. Evaluation is based upon a level of written communication, technical proficiency, and engineering analysis appropriate to a third-year engineering student. [Offered: F] ",
    "term": "3B",
    "x": 1000,
    "y": 900
  },
  {
    "course_code": "NE 352",
    "course_name": "Surfaces and Interfaces",
    "course_desc": "Surfaces and interfaces in microelectronics and nanofabrication. Physicochemistry of interfaces. Capillary phenomena and molecular self-assembly. Structure and properties of clean and adsorbate covered surfaces (metals, semiconductors, oxides). Reactions at surfaces and catalysis. Surface electrochemistry, growth and diffusion, nanoscale structure formation/surface patterning, biological interfaces. [Offered: F] ",
    "term": "3B",
    "x": 1000,
    "y": 1000
  },
  {
    "course_code": "NE 353",
    "course_name": "Nanoprobing and Lithography",
    "course_desc": "Theory and application of nanoprobing based on scanning probe microscopy (scanning tunneling microscopy, atomic force microscopy, scanning near-field optical microscopy). Nanolithographic techniques (extreme-UV lithography, X-ray lithography, e-beam lithography, focused ion beam lithography, nano-imprint lithography and soft lithography). [Offered: F]",
    "term": "3B",
    "x": 1000,
    "y": 1100
  },
  {
    "course_code": "NE 381",
    "course_name": "Introduction to Nanoscale Biosystems",
    "course_desc": "Specific aspects of biosystems required for the engineering of nanobiotechnological applications: topics to be covered may include surface and bulk science concepts needed for the development of lab-on-chip systems and those aspects of molecular biology of the cell necessary for application to medical diagnostics. Elements of design required for the development of modern instrumentation may also be covered, thereby providing a solid foundation for more advanced topics and applications. [Offered: F]",
    "term": "3B",
    "x": 1000,
    "y": 1200
  },
  {
    "course_code": "NE 408",
    "course_name": "Nanosystems Design Project",
    "course_desc": "Design work for the project proposed in NE 307, culminating in a progress report presentation. [Offered: F]",
    "term": "4A",
    "x": 1200,
    "y": 0
  },
  {
    "course_code": "NE 409",
    "course_name": "Nanosystems Design Project and Symposium",
    "course_desc": "Completion and presentation of the design project from NE 307 and NE 408. Teams communicate their design in the form of a final report, a poster, and a seminar presentation. [Offered: W]",
    "term": "4B",
    "x": 1400,
    "y": 0
  },
  {
    "course_code": "NE 450",
    "course_name": "Work-term Report 3",
    "course_desc": "An engineering report based upon a technical project, activity, or analysis carried out by the student, normally during work-term employment following the 3B academic term. Evaluation is based upon a level of written communication, technical proficiency, and engineering analysis appropriate to a fourth-year engineering student. [Offered: W] ",
    "term": "4B",
    "x": 1400,
    "y": 100
  },
  {
    "course_code": "NE 451",
    "course_name": "Simulation Methods",
    "course_desc": "This course provides an introduction to and an overview of computational methods that are currently employed for the simulation of structural and bulk properties of matter, particularly as applied to physical and biological systems at the nanometer scale. Topics to be covered in this course include energy functions and force fields, geometry optimization, normal mode analysis, and reaction--path techniques at the molecular level, and an introduction to the simulation of static and dynamic properties of substances via both Monte Carlo and molecular dynamics (MD) methodologies. [Offered: F]",
    "term": "4A",
    "x": 1200,
    "y": 100
  },
  {
    "course_code": "NE 452",
    "course_name": "Special Topics in Nanoscale Simulations",
    "course_desc": "Topics in this theme area may include: an overview of modern computational methods and algorithms in nanoscale materials, such as steered molecular dynamics, ab initio molecular dynamics, multiscale modelling, dissipative particle dynamics, transition path sampling, phase-field modelling, quantum simulations using Feynman path integral techniques, condensed-phase spectroscopy, linking of simulations to experiment, simulations and their practical applications. [Offered: W]",
    "term": "4B",
    "x": 1400,
    "y": 200
  },
  {
    "course_code": "NE 453",
    "course_name": "Special Topics in Nanotechnology Engineering",
    "course_desc": "Special topics that significantly span two (or more) areas of concentration in or that provide methodologies relevant to nanotechnology engineering will be offered from time to time when resources are available. [Offered: F,W]",
    "term": "4A",
    "x": 1200,
    "y": 200
  },
  {
    "course_code": "NE 454A",
    "course_name": "Nano-electronics Laboratory 1",
    "course_desc": "Application of experimental tools and techniques in nano-electronics. Experimental exercises may involve circuit simulation and design, circuit prototyping, design of a driver circuit for a quartz crystal microbalance (QCM), printed circuit board (PCB) design and layout optimization, and the use of various characterization instrumentation. [Offered: F]",
    "term": "4A",
    "x": 1200,
    "y": 300
  },
  {
    "course_code": "NE 454B",
    "course_name": "Nano-instrumentation Laboratory 1",
    "course_desc": "Application of experimental tools and techniques involved in nanotechnology. Experimental exercises may involve simulation, design, optimization of micro-electro-mechanical-system (MEMS) devices, and the generation of a mask layout. [Offered: F]",
    "term": "4A",
    "x": 1200,
    "y": 400
  },
  {
    "course_code": "NE 454C",
    "course_name": "Nanobiosystems Laboratory 1",
    "course_desc": "Application of experimental tools and techniques in nanobiotechnology. Experimental exercises may involve simulation and design, optimization, nanoparticle formulation reactions, microfluidics, and the use of various characterization instrumentation. [Offered: F]",
    "term": "4A",
    "x": 1200,
    "y": 500
  },
  {
    "course_code": "NE 454D",
    "course_name": "Nanostructured Materials Laboratory 1",
    "course_desc": "Application of experimental tools and techniques in nanomaterials. Experimental exercises may involve design, use of image analysis software, optimization, electrodeposition, encapsulation and templating, synthetic chemistry protocols, and the use of selected characterization instrumentation. [Offered: F]",
    "term": "4A",
    "x": 1200,
    "y": 600
  },
  {
    "course_code": "NE 455A",
    "course_name": "Nano-electronics Laboratory 2",
    "course_desc": "Application of experimental tools and techniques in nano-electronics. Experimental exercises to complete the design cycle involve printed circuit board (PCB) assembly and soldering, measurement of the formation of a nonanethiol self- assembled monolayer, determination of the partition coefficient for a solvent vapour into a monolayer-protected-cluster film deposited on a quartz crystal microbalance (QCM), and the use of various characterization methods. These exercises also stress the safe handling of chemicals in the process. [Offered: W]",
    "term": "4B",
    "x": 1400,
    "y": 300
  },
  {
    "course_code": "NE 455B",
    "course_name": "Nano-instrumentation Laboratory 2",
    "course_desc": "Application of experimental tools and techniques employed in nanotechnology. Experimental exercises may involve microfabrication (photolithography, film deposition, and etching) and testing of micro-electro-mechanical-system (MEMS) devices based on the design from NE 454B. These exercises also stress working safely in a clean-room environment. [Offered: W]",
    "term": "4B",
    "x": 1400,
    "y": 400
  },
  {
    "course_code": "NE 455C",
    "course_name": "Nanobiosystems Laboratory 2",
    "course_desc": "Application of experimental tools and techniques employed in Nanobiotechnology. Experimental exercises may involve investigation of microbial culture protocols, biosensor applications, and the use of various characterization techniques. These exercises also stress the need for safe handling of micro-organisms and biomaterials. [Offered: W]",
    "term": "4B",
    "x": 1400,
    "y": 500
  },
  {
    "course_code": "NE 455D",
    "course_name": "Nanostructured Materials Laboratory 2",
    "course_desc": "Application of experimental tools and techniques employed in nanomaterials. Experimental exercises may investigate and design the production and performance of electronic double layer capacitors (EDLC) for battery applications through the use of dispersion and mixing protocols to prepare carbon materials. Performance of the materials may be quantified using defined testing methods for measurement of electrical storage metrics. The exercise also stresses safe handling of nanomaterials. [Offered: W]",
    "term": "4B",
    "x": 1400,
    "y": 600
  },
  {
    "course_code": "NE 459",
    "course_name": "Nanotechnology Engineering Research Project",
    "course_desc": "A nanotechnology engineering research project that requires students to demonstrate initiative and to assume responsibility. Students will select projects at the end of the 4A term. Although students may propose their own projects, a faculty member will provide supervision. A project report is required at the end of the 4B term. [Offered: W]",
    "term": "4B",
    "x": 1400,
    "y": 700
  },
  {
    "course_code": "NE 461",
    "course_name": "Micro and Nano-instrumentation",
    "course_desc": "Fabrication technology for development of micro and nanosensors, actuators, and modules (e.g., micro or, nano-electromechanical systems, micro or nanofluidics channels). Integration using examples drawn from chemical analysis micro and nano-instrumentation. An overview of current micro and nano-instrumentation. [Offered: F]",
    "term": "4A",
    "x": 1200,
    "y": 700
  },
  {
    "course_code": "NE 466",
    "course_name": "Tactile Sensors and Transducers",
    "course_desc": "Tactile sensors, wearable sensors and applications. Principles of transduction including capacitive, piezoelectric, piezoresistive, percolation, and tunneling-based sensing. Designing bendable and stretchable sensors, and self-powered sensors. Applications including robotics, electronic skin, biometrics, and bio-vitals. [Offered: W]",
    "term": "4B",
    "x": 1400,
    "y": 800
  },
  {
    "course_code": "NE 471",
    "course_name": "Nano-electronics",
    "course_desc": "Transport phenomena. Quantum confinement. Single molecule transistors. Resonant tunnelling devices. Large area and mechanically flexible electronics. Deposition and patterning techniques. [Offered: F]",
    "term": "4A",
    "x": 1200,
    "y": 800
  },
  {
    "course_code": "NE 476",
    "course_name": "Organic Electronics",
    "course_desc": "Electronic structure of conjugated molecules. Photophysics of organic molecules, singlet and triplet states, the transition moment, radiative and non-radiative transitions. Excited state kinetics. Excitonic processes in organic solids, Forster and Dexter transfer, quenching processes. Electronic conduction in organic solids, band and hopping transport, morphological disorder and traps. Introduction to the main types of organic electronic devices, such as light-emitting devices, solar cells, field-effect transistors, photodetectors and imaging devices. Aspects of device design and fabrication technology. [Offered: W] ",
    "term": "4B",
    "x": 1400,
    "y": 900
  },
  {
    "course_code": "NE 481",
    "course_name": "Nanomedicine and Nanobiotechnology",
    "course_desc": "Overview of biomedical engineering principles. Formulation and manufacturing processes for production of nanoparticles for medical applications. Pharmacokinetics, toxicity, and human physiology in drug administration. Route of administration and controlled delivery strategies. Formulation and manufacturing process for drug delivery in the biotechnology and pharmaceutical industries. [Offered: F]",
    "term": "4A",
    "x": 1200,
    "y": 900
  },
  {
    "course_code": "NE 486",
    "course_name": "Biosensors",
    "course_desc": "Introduction to biosensors. Chemical, optical, and pattern recognition-based sensing. Sensors for metal ions, small molecules, proteins, cancer cells. Deoxyribonucleic acid/ribonucleic acid (DNA/RNA) properties and chemical synthesis. DNA aptamer-based sensors and devices. Combinatorial selection of functional DNA. Applications in drug screening and diagnostics. [Offered: F]",
    "term": "4A",
    "x": 1200,
    "y": 1000
  },
  {
    "course_code": "NE 487",
    "course_name": "Microfluidic and Nanobiotechnological Systems",
    "course_desc": "Principles, design, and fabrication methods for biomedical devices. Techniques for disease diagnosis, including enzyme-linked immunosorbent assays, current state-of-the-art technologies, lab-on-a-chip devices and biosensors. Microfluidic device design and fabrication. Cleanroom fabrication, soft lithography, hot embossing, micro-milling, and testing. [Offered: W]",
    "term": "4B",
    "x": 1400,
    "y": 1000
  },
  {
    "course_code": "NE 488",
    "course_name": "Biomaterials and Biomedical Design",
    "course_desc": "An overview of nanomedicine and nanotechnology-based biomedical devices. Strategies and technologies for designing, testing, and manufacturing biomaterials and tissue-engineering products. Biological and clinical applications. Manufacturing challenges and regulatory procedures for commercialization. [Offered: W] ",
    "term": "4B",
    "x": 1400,
    "y": 1100
  },
  {
    "course_code": "NE 491",
    "course_name": "Nanostructured Materials",
    "course_desc": "Application of inorganic nanostructured materials and nanocomposites. Synthesis and processing techniques for inorganic nanomaterials and the devices that use them. Students will be required to provide critical analyses and seminar presentations of patents utilizing nanomaterials.[Offered: F]",
    "term": "4A",
    "x": 1200,
    "y": 1100
  },
  {
    "course_code": "NE 496",
    "course_name": "Nanomaterials for Electrochemical Energy Systems",
    "course_desc": "Nanomaterials in electrochemical energy systems, electrochemical reactions, and cell potentials. Nernst equation. Electrode kinetics and mass transport. Electrochemical reactor design. Fuel cells, electrocatalytic reactions, and hydrogen economy. Rechargeable batteries. Design aspects of energy systems. Applications in hybrid and electric vehicles. [Offered: W] ",
    "term": "4B",
    "x": 1400,
    "y": 1200
  }
]
